In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style('whitegrid')

---
Pandas Series

In [0]:
labels = ['a','b', 'c']

mylist = [10,20,30]

arr = np.array(mylist)

my_dict = {'a':10,
           'b':20,
           'c':30}

In [3]:
# Create Series from list
pd.Series(data = mylist)

0    10
1    20
2    30
dtype: int64

In [4]:
# Create from array

pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [5]:
# Create labels as index

pd.Series(data = arr,
          index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
# Create from dictionary
# We can see the index names
pd.Series(my_dict)

a    10
b    20
c    30
dtype: int64

In [7]:
# Data can be of different types
# Pandas Series can save them with no problem. 
# but such a data series is not normal

pd.Series(['a', 1 , 2, np.nan, [1,2,[100,1000,1000]], {'a':np.random.randint(30,size = 3),
                                                       'b':np.random.randint(30,size = 3)}])

0                                     a
1                                     1
2                                     2
3                                   NaN
4             [1, 2, [100, 1000, 1000]]
5    {'a': [0, 5, 27], 'b': [6, 27, 7]}
dtype: object

In [0]:
labels = ['USA', 'Germany', 'Japan', 'Italy']

ser1 = pd.Series(data = [1,2,3,4],
                 index=labels)

In [9]:
ser1

USA        1
Germany    2
Japan      3
Italy      4
dtype: int64

In [10]:
ser1['USA']

1

In [11]:
ser1['Italy']

4

In [0]:
ser2 = pd.Series([11,23,65,14],
                index=['USA','Italy', 'Germany', 'Brazil'])

In [13]:
ser2

USA        11
Italy      23
Germany    65
Brazil     14
dtype: int64

In [14]:
# Adding named index
# Missing match has NaN value
ser1 + ser2

Brazil      NaN
Germany    67.0
Italy      27.0
Japan       NaN
USA        12.0
dtype: float64

---
Pandas DataFrame

In [0]:
from numpy.random import randn

In [0]:
rand_mat = randn(5,4)

In [17]:
rand_mat

array([[-0.98211981,  1.78715028,  0.767374  , -1.2569153 ],
       [-0.53827803, -0.92221777,  1.51635553,  0.83229572],
       [ 0.05725042, -0.3151264 ,  0.54995317, -0.71366213],
       [-0.31446331, -1.50390024, -0.63614661, -1.74178988],
       [-0.0310158 , -0.97583242,  0.45634855, -0.6863551 ]])

In [18]:
# Creating a DataFrame
df = pd.DataFrame(rand_mat)
df

          0         1         2         3
0 -0.982120  1.787150  0.767374 -1.256915
1 -0.538278 -0.922218  1.516356  0.832296
2  0.057250 -0.315126  0.549953 -0.713662
3 -0.314463 -1.503900 -0.636147 -1.741790
4 -0.031016 -0.975832  0.456349 -0.686355

In [19]:
# Naming the index

df = pd.DataFrame(rand_mat, index = 'A B C D E'.split())
df

          0         1         2         3
A -0.982120  1.787150  0.767374 -1.256915
B -0.538278 -0.922218  1.516356  0.832296
C  0.057250 -0.315126  0.549953 -0.713662
D -0.314463 -1.503900 -0.636147 -1.741790
E -0.031016 -0.975832  0.456349 -0.686355

In [20]:
df = pd.DataFrame(rand_mat, index = 'A B C D E'.split(),
                  columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A -0.982120  1.787150  0.767374 -1.256915
B -0.538278 -0.922218  1.516356  0.832296
C  0.057250 -0.315126  0.549953 -0.713662
D -0.314463 -1.503900 -0.636147 -1.741790
E -0.031016 -0.975832  0.456349 -0.686355

In [0]:
# Slicing Data From DataFrame

In [22]:
# Selecting `W` column
df['W']

A   -0.982120
B   -0.538278
C    0.057250
D   -0.314463
E   -0.031016
Name: W, dtype: float64

In [23]:
# Select W and Y Columns

df[['W', 'Y']]

          W         Y
A -0.982120  0.767374
B -0.538278  1.516356
C  0.057250  0.549953
D -0.314463 -0.636147
E -0.031016  0.456349

In [0]:
# Create a new Column
# Adding W and Y columns
df['NEW'] = df['W'] + df['Y']

In [25]:
df

          W         X         Y         Z       NEW
A -0.982120  1.787150  0.767374 -1.256915 -0.214746
B -0.538278 -0.922218  1.516356  0.832296  0.978077
C  0.057250 -0.315126  0.549953 -0.713662  0.607204
D -0.314463 -1.503900 -0.636147 -1.741790 -0.950610
E -0.031016 -0.975832  0.456349 -0.686355  0.425333

In [26]:
# Remove a column

df.drop(columns=['NEW'])

          W         X         Y         Z
A -0.982120  1.787150  0.767374 -1.256915
B -0.538278 -0.922218  1.516356  0.832296
C  0.057250 -0.315126  0.549953 -0.713662
D -0.314463 -1.503900 -0.636147 -1.741790
E -0.031016 -0.975832  0.456349 -0.686355

In [27]:
# Set inplace = True to make the Drop permanent
# We will try it again
df

          W         X         Y         Z       NEW
A -0.982120  1.787150  0.767374 -1.256915 -0.214746
B -0.538278 -0.922218  1.516356  0.832296  0.978077
C  0.057250 -0.315126  0.549953 -0.713662  0.607204
D -0.314463 -1.503900 -0.636147 -1.741790 -0.950610
E -0.031016 -0.975832  0.456349 -0.686355  0.425333

In [0]:
df.drop(columns='NEW', inplace=True)

In [29]:
df

          W         X         Y         Z
A -0.982120  1.787150  0.767374 -1.256915
B -0.538278 -0.922218  1.516356  0.832296
C  0.057250 -0.315126  0.549953 -0.713662
D -0.314463 -1.503900 -0.636147 -1.741790
E -0.031016 -0.975832  0.456349 -0.686355

In [30]:
# Drop row
df.drop('A')

          W         X         Y         Z
B -0.538278 -0.922218  1.516356  0.832296
C  0.057250 -0.315126  0.549953 -0.713662
D -0.314463 -1.503900 -0.636147 -1.741790
E -0.031016 -0.975832  0.456349 -0.686355

In [31]:
df.loc['A']

W   -0.982120
X    1.787150
Y    0.767374
Z   -1.256915
Name: A, dtype: float64

In [32]:
df.iloc[0]

W   -0.982120
X    1.787150
Y    0.767374
Z   -1.256915
Name: A, dtype: float64

In [33]:
df.loc[:,['X', 'Z']]

          X         Z
A  1.787150 -1.256915
B -0.922218  0.832296
C -0.315126 -0.713662
D -1.503900 -1.741790
E -0.975832 -0.686355

In [34]:
# indexing using rows and columns
# Using .loc

df.loc[['A','E'],['W', 'Z']]

          W         Z
A -0.982120 -1.256915
E -0.031016 -0.686355

In [35]:
# Using .loc

df.iloc[[0,4],[0,3]]

          W         Z
A -0.982120 -1.256915
E -0.031016 -0.686355

---
Conditional Selection

In [36]:
df > 0

       W      X      Y      Z
A  False   True   True  False
B  False  False   True   True
C   True  False   True  False
D  False  False  False  False
E  False  False   True  False

In [37]:
df[df > 0]

         W        X         Y         Z
A      NaN  1.78715  0.767374       NaN
B      NaN      NaN  1.516356  0.832296
C  0.05725      NaN  0.549953       NaN
D      NaN      NaN       NaN       NaN
E      NaN      NaN  0.456349       NaN

In [38]:
df[df['W'] > 0]['W']

C    0.05725
Name: W, dtype: float64

In [39]:
df[ (df['W'] > 0) & (df['Y'] < 1)]

         W         X         Y         Z
C  0.05725 -0.315126  0.549953 -0.713662

Resetting the index

In [40]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.982120  1.787150  0.767374 -1.256915
1     B -0.538278 -0.922218  1.516356  0.832296
2     C  0.057250 -0.315126  0.549953 -0.713662
3     D -0.314463 -1.503900 -0.636147 -1.741790
4     E -0.031016 -0.975832  0.456349 -0.686355

In [41]:
# Change the index manually
df.set_index(keys=['CA NY WY CT PA'.split()])

           W         X         Y         Z
CA -0.982120  1.787150  0.767374 -1.256915
NY -0.538278 -0.922218  1.516356  0.832296
WY  0.057250 -0.315126  0.549953 -0.713662
CT -0.314463 -1.503900 -0.636147 -1.741790
PA -0.031016 -0.975832  0.456349 -0.686355

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
W    5 non-null float64
X    5 non-null float64
Y    5 non-null float64
Z    5 non-null float64
dtypes: float64(4)
memory usage: 360.0+ bytes

In [43]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.361725 -0.385985  0.530777 -0.713285
std    0.419286  1.285762  0.773783  0.967329
min   -0.982120 -1.503900 -0.636147 -1.741790
25%   -0.538278 -0.975832  0.456349 -1.256915
50%   -0.314463 -0.922218  0.549953 -0.713662
75%   -0.031016 -0.315126  0.767374 -0.686355
max    0.057250  1.787150  1.516356  0.832296

In [44]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [45]:
(df['W'] > 0).value_counts()

False    4
True     1
Name: W, dtype: int64

---
GroupBy Operations
- Split
- Apply
- Combine

In [46]:
# Make some data up

df = pd.DataFrame({'Company':'MSFT MSFT GOOG GOOG FB FB'.split(),
                   'Employees':'Jack Mike Alex Mila Maya Lexi'.split(),
                   'Salary':[80,90,110,102,95,98]})

df.head()

  Company Employees  Salary
0    MSFT      Jack      80
1    MSFT      Mike      90
2    GOOG      Alex     110
3    GOOG      Mila     102
4      FB      Maya      95

In [47]:
df.groupby('Company').mean()

         Salary
Company
FB         96.5
GOOG      106.0
MSFT       85.0

In [48]:
df.groupby('Company').std()

           Salary
Company
FB       2.121320
GOOG     5.656854
MSFT     7.071068

In [49]:
df.groupby('Company').describe()

        Salary
         count   mean       std    min     25%    50%     75%    max
Company
FB         2.0   96.5  2.121320   95.0   95.75   96.5   97.25   98.0
GOOG       2.0  106.0  5.656854  102.0  104.00  106.0  108.00  110.0
MSFT       2.0   85.0  7.071068   80.0   82.50   85.0   87.50   90.0

In [50]:
df.groupby('Company').describe().transpose()

Company             FB        GOOG       MSFT
Salary count   2.00000    2.000000   2.000000
       mean   96.50000  106.000000  85.000000
       std     2.12132    5.656854   7.071068
       min    95.00000  102.000000  80.000000
       25%    95.75000  104.000000  82.500000
       50%    96.50000  106.000000  85.000000
       75%    97.25000  108.000000  87.500000
       max    98.00000  110.000000  90.000000

---
Pandas Operations

In [0]:

df = pd.DataFrame({'Company':'MSFT MSFT GOOG GOOG FB FB'.split(),
                   'Employees':'Jack Mike Alex Mila Maya Lexi'.split(),
                   'Salary':[80,90,110,102,90,98]})

In [52]:
df

  Company Employees  Salary
0    MSFT      Jack      80
1    MSFT      Mike      90
2    GOOG      Alex     110
3    GOOG      Mila     102
4      FB      Maya      90
5      FB      Lexi      98

In [53]:
df['Salary'].unique()

array([ 80,  90, 110, 102,  98])

In [54]:
df['Salary'].nunique()

5

In [55]:
df['Salary'].value_counts()

90     2
98     1
110    1
102    1
80     1
Name: Salary, dtype: int64

Applying functions to columns

In [0]:
def times_two(x):

  return 2 * x

In [57]:
df.apply(times_two)

    Company Employees  Salary
0  MSFTMSFT  JackJack     160
1  MSFTMSFT  MikeMike     180
2  GOOGGOOG  AlexAlex     220
3  GOOGGOOG  MilaMila     204
4      FBFB  MayaMaya     180
5      FBFB  LexiLexi     196

In [58]:
df['Salary'].apply(times_two)

0    160
1    180
2    220
3    204
4    180
5    196
Name: Salary, dtype: int64

In [59]:
df.columns

Index(['Company', 'Employees', 'Salary'], dtype='object')

In [60]:
df.sort_values(by = 'Employees')

  Company Employees  Salary
2    GOOG      Alex     110
0    MSFT      Jack      80
5      FB      Lexi      98
4      FB      Maya      90
1    MSFT      Mike      90
3    GOOG      Mila     102

Done